{
  "activation_function": "gelu",
  "architectures": [
    "GPT2LMHeadModel"
  ],
  "attn_pdrop": 0.1,
  "embd_pdrop": 0.1,
  "initializer_range": 0.02,
  "layer_norm_epsilon": 1e-05,
  "model_type": "gpt2",
  "n_embd": 768,
  "n_inner": 3072,
  "n_head": 12,
  "n_layer": 12,
  "resid_pdrop": 0.1,
  "vocab_size": 30004,
  "n_ctx": 128,
  "n_positions": 128
}